PH_data/alpha_1.3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/




FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    hill
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1100;
        startFace       44753;
    }
    top-wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          234;
        startFace       45853;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          22462;
        startFace       46087;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          22462;
        startFace       68549;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          45;
        startFace       91011;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  cyclicAMI_inlet;
        separationVector ( -11.7 0 0 );
        lowWeightCorrection 0.01;
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          45;
        startFace       91056;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  cyclicAMI_outlet;
        separationVector ( 11.7 0 0 );
        lowWeightCorrection 0.01;
    }
)

// ************************************************************************* //
