PH_data/alpha_1.3/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
22462
(
( 1.798171212e-07 -5.754278165e-10 -3.045239616e-09 8.121967682e-11 3.417471167e-11 2.448183807e-07 )
( 7.042050925e-07 -3.787574254e-09 -1.073035172e-08 7.194475571e-10 2.092042095e-10 9.205303968e-07 )
( 1.790393469e-07 -5.827772154e-10 -3.03105141e-09 8.07715006e-11 2.206295563e-11 2.439842035e-07 )
( 1.956145979e-06 -1.742197853e-08 -2.624116746e-08 4.370862783e-09 7.741914887e-10 2.417254336e-06 )
( 7.012779975e-07 -3.813636518e-09 -1.072166977e-08 7.126402246e-10 1.515553932e-10 9.1768527e-07 )
( 1.782784835e-07 -5.841334638e-10 -3.003929328e-09 7.943626312e-11 2.034547704e-11 2.433708062e-07 )
( 4.095742042e-06 -5.493732758e-08 -4.819887067e-08 1.740739286e-08 1.901993674e-09 4.72680631e-06 )
( 1.94839231e-06 -1.75188184e-08 -2.659691845e-08 4.338963411e-09 6.426617571e-10 2.408033197e-06 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
