PH_data/alpha_1.3/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
22462
(
( 0.0003670255537 7.010413583e-08 -1.805080956e-06 )
( 0.0008070257027 1.008090607e-07 -3.838238626e-06 )
( 0.0003670699371 7.12923196e-08 -1.769016308e-06 )
( 0.001480170758 1.66064055e-07 -6.579062756e-06 )
( 0.0008071112679 1.046998008e-07 -3.686208629e-06 )
( 0.0003670573351 7.191336948e-08 -1.675624503e-06 )
( 0.002292456338 1.222467318e-07 -9.537971891e-06 )
( 0.001480430248 1.791142239e-07 -6.509869763e-06 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
